Tekla Open API Reference for Tekla Structures 2025
InputObjectTypeAttribute Class
 The InputObjectTypeAttribute class is used for storing the type of the input. Based on the type the system can then correctly ask for user input in the creation. The attribute is initialized from the custom attribute [InputObjectType(ConnectionBase.InputObjectType.INPUTOBJECT_PART)] in the connection source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.InputObjectTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class InputObjectTypeAttribute : Attribute
Public NotInheritable Class InputObjectTypeAttribute
	Inherits Attribute
The InputObjectTypeAttribute type exposes the following members.
Constructors
Name | Description
InputObjectTypeAttribute(Int32)
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
InputObjectTypeAttribute(ConnectionBase.InputObjectType)
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace